---
kind: method
id: M:Autodesk.Revit.DB.ColorWithTransparency.GetColor
source: html/a272f155-0bd7-0f3f-7d37-bb0b853930ef.htm
---
# Autodesk.Revit.DB.ColorWithTransparency.GetColor Method

get color

## Syntax (C#)
```csharp
public Color GetColor()
```

## Returns
color